<a href="https://colab.research.google.com/github/demax44/Capstone/blob/master/Candy_Sales.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Practice creating store. I am praticing with Dot and numpy

In [ ]:
## Dot Butter

In [10]:
import numpy as np
import pandas as pd

In [16]:
np.random.seed()
sales_total=np.random.randint(2000,size=(5,3))
sales_total

array([[1887, 1413, 1811],
       [1195, 1835, 1833],
       [ 946,  489, 1539],
       [ 925,  901,  172],
       [ 756,  469,  307]])

In [18]:
Monthly_sales=pd.DataFrame(sales_total,index=["December",'January','Feburary','March',"April"],columns=["Gold chocolate ","Monkey Gum","Marshmellows Bars"])
Monthly_sales

          Gold chocolate   Monkey Gum  Marshmellows Bars
December             1887        1413               1811
January              1195        1835               1833
Feburary              946         489               1539
March                 925         901                172
April                 756         469                307

In [19]:
## making a price array
prices=np.array([14,8,18])
prices

array([14,  8, 18])

In [22]:
Candy_prices=pd.DataFrame(prices.reshape(1,3),index=['Price'],columns=["Gold chocolate ","Monkey Gum","Marshmellows Bars"])
Candy_prices

       Gold chocolate   Monkey Gum  Marshmellows Bars
Price               14           8                 18

In [23]:
Month_sales=Candy_prices.dot(Monthly_sales.T)
Month_sales

       December  January  Feburary  March  April
Price     70320    64404     44858  23254  19862

In [24]:
#daily sales
Candy_prices

       Gold chocolate   Monkey Gum  Marshmellows Bars
Price               14           8                 18

In [25]:
Month_sales

       December  January  Feburary  March  April
Price     70320    64404     44858  23254  19862

In [27]:
Monthly_sales

          Gold chocolate   Monkey Gum  Marshmellows Bars
December             1887        1413               1811
January              1195        1835               1833
Feburary              946         489               1539
March                 925         901                172
April                 756         469                307

In [42]:
Monthly_sales
## error in Column

          Gold chocolate   Monkey Gum  ...  Total ($)  Monthly Total ($)
December             1887        1413  ...    70320.0            70320.0
January              1195        1835  ...    64404.0            64404.0
Feburary              946         489  ...    44858.0            44858.0
March                 925         901  ...    23254.0            23254.0
April                 756         469  ...    19862.0            19862.0

[5 rows x 5 columns]

In [40]:
MonthlySales=Monthly_sales.drop(columns="Monthly Total ($)")

In [41]:
MonthlySales

          Gold chocolate   Monkey Gum  Marshmellows Bars  Total ($)
December             1887        1413               1811    70320.0
January              1195        1835               1833    64404.0
Feburary              946         489               1539    44858.0
March                 925         901                172    23254.0
April                 756         469                307    19862.0